# Задачи "Практика 1"
# Задача 1.1

name = input("Ваши фамилия, имя? ")
age = input("Сколько Вам лет? ")
place_of_residence = input("Где вы живете? ")
print("- ФИО:", name)
print("- Возраст:", age)
print("- Место жительства:", place_of_residence)