# Задачи "Практика 5"
# Задача 5.3

print("Задача 5.3")
# n3 = input("Введите строку: \n")
n3 = "Строки с точкой заменяются на пробел: ->.<- , ->.<-, ->.<- "
zamena = n3.replace('.', '')

res = len(n3) - len(zamena)

print(n3)
print("Переменная ->", zamena)
print("Кол-во замен: ", res)
print()


# 5.8
print("Задача 5.8")
n8 = "Дана строка, заканчивающаяся точкой."
n8 = n8.strip(".")
m = n8.split()
print("Кол-во слов в строке: ",len(m))
